controllers/CountryController.php

    protected function findModel($code)
    {
        if (($model = Country::findOne(['code' => $code])) !== null) {
---
SELECT * FROM `country` WHERE `code`='QA'